Управление_торговлей.ПБТ/src/DataProcessors/вт_РасчетыПлановойСебестоимости/вт_РасчетыПлановойСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>вт_РасчетыПлановойСебестоимости</name>
  <attributes>
    <name>ПланПроизводства</name>
    <type>
      <types>DocumentRef.вт_ПланПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПустойУникИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Управление_торговлей.ПБТ/src/AccumulationRegisters/Закупки/Закупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="99326c2e-b338-40c0-a601-ae5e673e9fb7">
  <name>Закупки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <resources extendedConfigurationObject="b8cfb710-2e8e-4757-bb47-c6cf9a7d37e9">
    <name>Стоимость</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="e3de6fae-c863-4ba4-9975-beed3356a961">
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="b7a026e1-1caa-4493-b092-9156011e46bf">
    <name>АналитикаУчетаНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="e5f80ee1-11ee-4805-9a52-c7edb03a422e">
  <name>ЦеныНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="695d5be0-2491-490f-9689-78e3615b85de">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="9c3a50fe-c553-436b-9ff3-29e6bf5abe55">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa1025d7-0232-4124-8a64-816e44306389">
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="ba4dab77-7956-4903-8aff-17c9e06ea5fa">
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей.ПБТ/src/Enums/вт_ВариантРасчетаПлановойСебестоимости/вт_ВариантРасчетаПлановойСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вт_ВариантРасчетаПлановойСебестоимости</name>
  <enumValues>
    <name>ПоУчетнымЦенам</name>
  </enumValues>
  <enumValues>
    <name>ПоПоследнемуПоступлению</name>
  </enumValues>
  <enumValues>
    <name>ПоТекущейСтоимостиОстатков</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Documents/вт_ПланПроизводства/вт_ПланПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_ПланПроизводства</name>
  <basedOn>Document.вт_ЗаказВПроизводство</basedOn>
  <registerRecords>AccumulationRegister.вт_ПланПроизводстваТоваров</registerRecords>
  <registerRecords>AccumulationRegister.вт_ПлановаяСебестоимостьВыпуска</registerRecords>
  <registerRecords>InformationRegister.вт_СтатусыЗаказовВПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ПланПроизводства</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПланаПроизводства</name>
    <type>
      <types>EnumRef.вт_СтатусыПроизводства</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладОсновной</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПроизводства</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef.вт_ЗаказВПроизводство</types>
      <types>DocumentRef.ЗаказКлиента</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>НормативныйВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаСебестоимости</name>
    <type>
      <types>EnumRef.вт_ВариантРасчетаПлановойСебестоимости</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводстваФормироватьРегламентнымЗаданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПланирования</name>
    <type>
      <types>EnumRef.вт_ВидыПланированияПроизводства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РеквизитПланПоЗаказам</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВЗаказе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заказ</name>
      <type>
        <types>DocumentRef.вт_ЗаказВПроизводство</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроизводства</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РеквизитТаблицаПлана</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксЗапас</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КритическийОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланПроизводства</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГотоваяПродукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ПотребностьПоготовойПродукции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <comment>Таблица товров, для которых нужно изготовить продукцию</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>МинимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальныйОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВПроизводство</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоОстаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выбрано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПроизводства</name>
      <type>
        <types>CatalogRef.вт_ВариантыПроизводстваПоТехКартам</types>
      </type>
    </attributes>
    <attributes>
      <name>КодСтрокиРодитель</name>
      <comment>Код родительской строки когда есть зависимые полуфабрикаты</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиТоваровПоскладам</name>
    <comment>Остатки товаров по складам на момент работы с документом</comment>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиКомплектовПоСкладам</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Остаток</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПланПоОперциям</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ГотоваяПродукция</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Норма</name>
      <comment>Норматив выполнения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПлановаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСтроки</name>
      <comment>Ссылка на производимое изделие в ТЧ Товары</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/DataProcessors/вт_РасчетыПлановойСебестоимости/ObjectModule.bsl
//Обходим по дереву сверху вниз и собирем цены номенклатуры. 
//Копируем в таблицы документа
Процедура СкопироватьЦеныДереваВТаблицы(ДеревоЗн, ДокОбъект) Экспорт
	
	ОбходДереваВнизТаблицаЦен(ДеревоЗн.Строки, ДокОбъект);

КонецПроцедуры

Функция ПолучитьНоменклатурыДерева(Дерево) Экспорт
   МассивНом = Новый Массив;
   
	МассивН = Новый Массив;
	МассивН.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТиповН = Новый ОписаниеТипов(МассивН);

	МассивХ = Новый Массив;
	МассивХ.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ОписаниеТиповХ = Новый ОписаниеТипов(МассивХ);
	
   
   ТЗТоварХарактеристика = Новый ТаблицаЗначений;
   ТЗТоварХарактеристика.Колонки.Добавить("Номенклатура",   ОписаниеТиповН);
   ТЗТоварХарактеристика.Колонки.Добавить("Характеристика", ОписаниеТиповХ);
   
   ЗаполнитьМассивНоменклатурПоСтрокамДерева(Дерево.Строки,ТЗТоварХарактеристика);
   
   //Пакуем в структур и массив
   Для Каждого СтрокаТЗ из ТЗТоварХарактеристика Цикл
	   Структ = Новый Структура("Номенклатура,Характеристика",СтрокаТЗ.Номенклатура , СтрокаТЗ.Характеристика);
	   МассивНом.Добавить(Структ);
   КонецЦикла;
   
   Возврат МассивНом;
	
КонецФункции

Процедура ЗаполнитьМассивНоменклатурПоСтрокамДерева(СтрокиДерева, ТЗ)
	Для Каждого СтрокаД из СтрокиДерева Цикл
		
		МассивСтрок = ТЗ.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",СтрокаД.Номенклатура,СтрокаД.Характеристика));
				
		Если МассивСтрок.количество() = 0 Тогда
			НовСтрока = ТЗ.Добавить();
			НовСтрока.Номенклатура = СтрокаД.Номенклатура;
			НовСтрока.Характеристика = СтрокаД.Характеристика ;
		КонецЕсли;
		
		ЗаполнитьМассивНоменклатурПоСтрокамДерева(СтрокаД.Строки, ТЗ);
		
	КонецЦикла;
КонецПроцедуры	

Процедура ОбходДереваВнизТаблицаЦен(Строки, ДокОбъект)
	Для Каждого СтрокаДерева из Строки цикл
		ОтборПоиска = Новый Структура("КодСтроки, Номенклатура", СтрокаДерева.КодСтроки, СтрокаДерева.Номенклатура);
		Если СтрокаДерева.ЭтоРабота Тогда
			МассивСтрок = ДокОбъект.ПланПоОперциям.НайтиСтроки(ОтборПоиска);
		ИначеЕсли 	СтрокаДерева.ЭтоСырье ТОгда
			МассивСтрок = ДокОбъект.РеквизитТаблицаПлана.НайтиСтроки(ОтборПоиска);			
		Иначе
			МассивСтрок = ДокОбъект.Товары.НайтиСтроки(ОтборПоиска);			
		КонецЕсли;
		
		Если МассивСтрок.Количество()>0 Тогда
			 МассивСтрок[0].ПлановаяЦена = СтрокаДерева.Цена;
		КонецЕсли;	
		
		Если СтрокаДерева.Строки.Количество()>0 Тогда
			ОбходДереваВнизТаблицаЦен(СтрокаДерева.Строки, ДокОбъект);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПлановуюСебестоимостьВыпуска(пВариантРасчета, ДеревоВыпуска) Экспорт
	
	
	// МассивНоменклатур = ПолучитьМассивНоменклатурПоПлану(ЭтотОбъект.ПланПроизводства);
	МассивНоменклатур = ПолучитьНоменклатурыДерева( ДеревоВыпуска);


	Если пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоПоследнемуПоступлению Тогда
		   ТаблицаЦен =  ЗаполнитьЦеныПоПоследнемуПоступлению(МассивНоменклатур, ЭтотОбъект.ПланПроизводства.Организация, ЭтотОбъект.ПланПроизводства.Дата);
	ИначеЕсли пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоТекущейСтоимостиОстатков Тогда
		   ТаблицаЦен = ЗаполнитьЦеныПоТекушейСтоимости(МассивНоменклатур, ЭтотОбъект.ПланПроизводства.Организация, ЭтотОбъект.ПланПроизводства.Дата);
	ИначеЕсли пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоУчетнымЦенам Тогда
		   ТаблицаЦен =   ЗаполнитьЦеныПоТипуЦен(МассивНоменклатур, ЭтотОбъект.ВидЦены, ЭтотОбъект.ПланПроизводства.Дата);		
	Иначе
	  Возврат;	   
	КонецЕсли;	
	   
	ЗаполнитьДеревоЦенами(ДеревоВыпуска, ТаблицаЦен);   
	
	РасчетПромежуточныхВыпусковДерева(ДеревоВыпуска);
	
КонецПроцедуры	

Процедура РасчетПлановойСебестоимостиВыпуска(пВариантРасчета, ДеревоВыпуска) Экспорт
	
	//ДеревоВыпуска = Новый ДеревоЗначений;
	//ДеревоВыпуска.Колонки.Добавить("КодСтроки"); //Уникальный код строки
	//ДеревоВыпуска.Колонки.Добавить("КлючСтроки"); //Ссылка на родительскую строку
	//ДеревоВыпуска.Колонки.Добавить("Номенклатура");
	//ДеревоВыпуска.Колонки.Добавить("ВариантПроизводства");
	//ДеревоВыпуска.Колонки.Добавить("Количество");
	//ДеревоВыпуска.Колонки.Добавить("Цена");
	//ДеревоВыпуска.Колонки.Добавить("Сумма");
	//ДеревоВыпуска.Колонки.Добавить("ЭтоРабота");
	//ДеревоВыпуска.Колонки.Добавить("ЭтоСырье");
	//

	
	МассивНоменклатур = новый Массив;   //Сюда сохраняем все сырье и работы
	
	
	ПостроитьДеревоПлановогоВыпуска(ДеревоВыпуска, ЭтотОбъект.ПланПроизводства, МассивНоменклатур);
	
	ТаблицаЦен = Новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура");
	ТаблицаЦен.Колонки.Добавить("Цена");
	
	Если пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоПоследнемуПоступлению Тогда
		   ТаблицаЦен =  ЗаполнитьЦеныПоПоследнемуПоступлению(МассивНоменклатур, ЭтотОбъект.ПланПроизводства.Организация, ЭтотОбъект.ПланПроизводства.Дата);
	ИначеЕсли пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоТекущейСтоимостиОстатков Тогда
		   ТаблицаЦен = ЗаполнитьЦеныПоТекушейСтоимости(МассивНоменклатур, ЭтотОбъект.ПланПроизводства.Организация, ЭтотОбъект.ПланПроизводства.Дата);
	ИначеЕсли пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоУчетнымЦенам Тогда
		   ТаблицаЦен =   ЗаполнитьЦеныПоТипуЦен(МассивНоменклатур, ЭтотОбъект.ВидЦены, ЭтотОбъект.ПланПроизводства.Дата);		
	КонецЕсли;	
	   
	ЗаполнитьДеревоЦенами(ДеревоВыпуска, ТаблицаЦен);   
	
	РасчетПромежуточныхВыпусковДерева(ДеревоВыпуска);
	
КонецПроцедуры	

Процедура РасчетПромежуточныхВыпусковДерева(ДеревоВыпуска, СуммаИтого = 0) Экспорт 
	
	Для Каждого СтрокаДерева из ДеревоВыпуска.Строки Цикл
	
		Если СтрокаДерева.Строки.Количество()>0 Тогда //Если есть вложенные строки, то сумму и цену текущей строки берем от вложенных
			СуммаПФ = 0;
			РасчетПромежуточныхВыпусковДерева(СтрокаДерева,СуммаПФ);
			Если ТипЗнч(СтрокаДерева.Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
				СтрокаДерева.Сумма = СуммаПФ;
				СтрокаДерева.Цена  = СтрокаДерева.Сумма / СтрокаДерева.Количество;
			КонецЕсли;
			СуммаИтого = СуммаИтого + СуммаПФ;
		КонецЕсли;
		
		
		СуммаИтого = СуммаИтого + СтрокаДерева.Сумма;
		
	КонецЦикла;
	
КонецПроцедуры	

Функция ПолучитьМассивНоменклатурПоПлану(ПланСсылка)
	Запрос = новый запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	вт_ПланПроизводстваРеквизитТаблицаПлана.Номенклатура КАК Номенклатура 
	                      |ИЗ
	                      |	Документ.вт_ПланПроизводства.РеквизитТаблицаПлана КАК вт_ПланПроизводстваРеквизитТаблицаПлана
	                      |ГДЕ
	                      |	вт_ПланПроизводстваРеквизитТаблицаПлана.Ссылка = &Ссылка
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	вт_ПланПроизводстваПланПоОперциям.Номенклатура
	                      |ИЗ
	                      |	Документ.вт_ПланПроизводства.ПланПоОперциям КАК вт_ПланПроизводстваПланПоОперциям
	                      |ГДЕ
	                      |	вт_ПланПроизводстваПланПоОперциям.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка",ПланСсылка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции	

Процедура ЗаполнитьДеревоЦенами(ДеревоВыпуска, ТаблицаЦен) Экспорт
	Для Каждого СтрокаЦен из ТаблицаЦен Цикл
		МассивСтрок = ДеревоВыпуска.Строки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика",СтрокаЦен.Номенклатура, СтрокаЦен.Характеристика),Истина);
		Для Каждого СтрокаДерева из МассивСтрок Цикл
			СтрокаДерева.Цена = СтрокаЦен.Цена;
			СтрокаДерева.Сумма = СтрокаДерева.Цена * СтрокаДерева.Количество;
		КонецЦикла;	
	КонецЦикла;
	
КонецПроцедуры	

Функция ПолучитьЦеныПоВариантуРасчета(МассивНоменклатурХарактеристик, Организация, ДатаОтчета, пВариантРасчета) Экспорт
	///В МассивНоменклатурХарактеристик содержатся элементы Структура с Номенклатура и Характеристика
	
	МассивН = Новый Массив;
	МассивН.Добавить(Тип("СправочникСсылка.Номенклатура"));
	ОписаниеТиповН = Новый ОписаниеТипов(МассивН);

	МассивХ = Новый Массив;
	МассивХ.Добавить(Тип("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ОписаниеТиповХ = Новый ОписаниеТипов(МассивХ);
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Номенклатура",ОписаниеТиповН);
	ТЗ.Колонки.Добавить("Характеристика",ОписаниеТиповХ);
	
	для Каждого Элем из МассивНоменклатурХарактеристик Цикл
		СтрокаТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЗ,Элем);
	КонецЦикла;
	
	Если пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоПоследнемуПоступлению Тогда
		   ТаблицаЦен =  ЗаполнитьЦеныПоПоследнемуПоступлению(ТЗ, Организация, ДатаОтчета);
	ИначеЕсли пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоТекущейСтоимостиОстатков Тогда
		   ТаблицаЦен = ЗаполнитьЦеныПоТекушейСтоимости(ТЗ, Организация, ДатаОтчета);
	ИначеЕсли пВариантРасчета = Перечисления.вт_ВариантРасчетаПлановойСебестоимости.ПоУчетнымЦенам Тогда
		   ТаблицаЦен =   ЗаполнитьЦеныПоТипуЦен(ТЗ, КонстантыСервер.ПолучитьЗначениеКонстанты("вт_ВидЦенПлановойСебестоимости"), ДатаОтчета);		
	КонецЕсли;		
	Возврат ТаблицаЦен;
	
КонецФункции	

Функция ЗаполнитьЦеныПоПоследнемуПоступлению(ТЗНоменклатурХар, Организация, ДатаОтчета) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ_Н.Номенклатура КАК Номенклатура,
	                      |	ВТ_Н.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_НОМ
	                      |ИЗ
	                      |	&ВТ_Н КАК ВТ_Н
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Закупки.АналитикаУчетаНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	МАКСИМУМ(Закупки.Период) КАК МаксПериод,
	                      |	Закупки.АналитикаУчетаНоменклатуры.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_МАКС_ДАТА
	                      |ИЗ
	                      |	РегистрНакопления.Закупки КАК Закупки
	                      |ГДЕ
	                      |	НАЧАЛОПЕРИОДА(Закупки.Период, ДЕНЬ) <= &Дата
	                      |	И (Закупки.АналитикаУчетаНоменклатуры.Номенклатура, Закупки.АналитикаУчетаНоменклатуры.Характеристика) В
	                      |			(ВЫБРАТЬ
	                      |				ВТ_НОМ.Номенклатура КАК Номенклатура,
	                      |				ВТ_НОМ.Характеристика КАК Характеристика
	                      |			ИЗ
	                      |				ВТ_НОМ КАК ВТ_НОМ)
	                      |	И Закупки.Организация = &Организация
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Закупки.АналитикаУчетаНоменклатуры.Номенклатура,
	                      |	Закупки.АналитикаУчетаНоменклатуры.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СРЕДНЕЕ(ЕСТЬNULL(ВЫБОР
	                      |				КОГДА Закупки.Количество <> 0
	                      |					ТОГДА Закупки.Стоимость / Закупки.Количество
	                      |				ИНАЧЕ Закупки.Стоимость
	                      |			КОНЕЦ, 0)) КАК Цена,
	                      |	ВТ_НОМ.Номенклатура КАК Номенклатура,
	                      |	ВТ_НОМ.Характеристика КАК Характеристика
	                      |ИЗ
	                      |	ВТ_НОМ КАК ВТ_НОМ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МАКС_ДАТА КАК ВТ_МАКС_ДАТА
	                      |		ПО (ВТ_МАКС_ДАТА.Номенклатура = ВТ_НОМ.Номенклатура)
	                      |			И (ВТ_МАКС_ДАТА.Характеристика = ВТ_НОМ.Характеристика)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Закупки КАК Закупки
	                      |		ПО (ВТ_МАКС_ДАТА.Номенклатура = Закупки.АналитикаУчетаНоменклатуры.Номенклатура)
	                      |			И (ВТ_МАКС_ДАТА.Характеристика = Закупки.АналитикаУчетаНоменклатуры.Характеристика)
	                      |			И (ВТ_МАКС_ДАТА.МаксПериод = Закупки.Период)
	                      |			И (Закупки.Организация = &Организация)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_НОМ.Номенклатура,
	                      |	ВТ_НОМ.Характеристика");
	

	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата",ДатаОтчета);
	Запрос.УстановитьПараметр("ВТ_Н",ТЗНоменклатурХар);
	
	Возврат ЗАпрос.Выполнить().Выгрузить();
	
	
КонецФункции

Функция ЗаполнитьЦеныПоТекушейСтоимости(ТЗ, Организация, ДатаОтчета ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВТ_Н.Номенклатура КАК Номенклатура,
	                      |	ВТ_Н.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ВТ_НОМ
	                      |ИЗ
	                      |	&ВТ_Н КАК ВТ_Н
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_НОМ.Номенклатура КАК Номенклатура,
	                      |	ВТ_НОМ.Характеристика КАК Характеристика,
	                      |	СУММА(ЕСТЬNULL(СебестоимостьТоваровОстатки.СтоимостьБезНДСОстаток, 0)) КАК СтоимостьОстаток,
	                      |	СУММА(ЕСТЬNULL(СебестоимостьТоваровОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	ВТ_НОМ КАК ВТ_НОМ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СебестоимостьТоваров.Остатки(
	                      |				&Дата,
	                      |				(АналитикаУчетаНоменклатуры.Номенклатура, АналитикаУчетаНоменклатуры.Характеристика) В
	                      |						(ВЫБРАТЬ
	                      |							ВТ.Номенклатура,
	                      |							ВТ.Характеристика
	                      |						ИЗ
	                      |							ВТ_НОМ КАК ВТ)
	                      |					И Организация = &Организация) КАК СебестоимостьТоваровОстатки
	                      |		ПО (СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Номенклатура = ВТ_НОМ.Номенклатура)
	                      |			И (СебестоимостьТоваровОстатки.АналитикаУчетаНоменклатуры.Характеристика = ВТ_НОМ.Характеристика)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_НОМ.Номенклатура,
	                      |	ВТ_НОМ.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Номенклатура КАК Номенклатура,
						  |	ВТ.Характеристика КАК Характеристика,
	                      |	ЕСТЬNULL(ВТ.СтоимостьОстаток, 0) КАК СтоимостьОстаток,
	                      |	ЕСТЬNULL(ВТ.КоличествоОстаток, 0) КАК КоличествоОстаток,
	                      |	ВЫБОР
	                      |		КОГДА ЕСТЬNULL(ВТ.КоличествоОстаток, 0) <> 0
	                      |			ТОГДА ЕСТЬNULL(ВТ.СтоимостьОстаток, 0) / ВТ.КоличествоОстаток
	                      |		ИНАЧЕ ЕСТЬNULL(ВТ.СтоимостьОстаток, 0)
	                      |	КОНЕЦ КАК Цена
	                      |ИЗ
	                      |	ВТ КАК ВТ");
	

	
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата",ДатаОтчета);
	Запрос.УстановитьПараметр("ВТ_Н",ТЗ);
	
	Возврат ЗАпрос.Выполнить().Выгрузить();	
	
КонецФункции

Функция ЗаполнитьЦеныПоТипуЦен(ТЗ, ТипЦены, ДатаОтчета) Экспорт
	  Запрос = Новый Запрос("ВЫБРАТЬ
	                        |	ВТ_Н.Номенклатура КАК Номенклатура,
	                        |	ВТ_Н.Характеристика КАК Характеристика
	                        |ПОМЕСТИТЬ ВТ_НОМ
	                        |ИЗ
	                        |	&ВТ_Н КАК ВТ_Н
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	ВТ_Н.Номенклатура КАК Номенклатура,
	                        |	ВТ_Н.Характеристика КАК Характеристика,
	                        |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК Цена
	                        |ИЗ
	                        |	ВТ_НОМ КАК ВТ_Н
	                        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	                        |				&Дата,
	                        |				(Номенклатура, Характеристика) В
	                        |						(ВЫБРАТЬ
	                        |							ВТ.Номенклатура,
	                        |							ВТ.Характеристика
	                        |						ИЗ
	                        |							ВТ_НОМ КАК ВТ)
	                        |					И ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
	                        |		ПО (ЦеныНоменклатурыСрезПоследних.Номенклатура = ВТ_Н.Номенклатура)
	                        |			И (ЦеныНоменклатурыСрезПоследних.Характеристика = ВТ_Н.Характеристика)");
	  
	  Запрос.УстановитьПараметр("Дата",ДатаОтчета);
	  Запрос.УстановитьПараметр("ВТ_Н",ТЗ);
	  Запрос.УстановитьПараметр("ВидЦены",ТипЦены);
	  
	  Возврат Запрос.Выполнить().Выгрузить(); 
 КонецФункции

Функция ЗаполнитьЦеныПоВсемВариантам(МассивНоменклатур, ДатаСреза, Организация, ТипЦены) Экспорт
	 
	  ТаблЦен1 = ЗаполнитьЦеныПоТекушейСтоимости(МассивНоменклатур, Организация, ДатаСреза);
	  МассивНоменклатур2 = Новый Массив;
	  
	  Для Каждого СтрокаЦены из ТаблЦен1 цикл
		  Если СтрокаЦены.цена = 0  ТОгда
			   МассивНоменклатур2.Добавить(СтрокаЦены.Номенклатура);
		  КонецЕсли;
	  КонецЦикла;
	  
	  Если МассивНоменклатур2.Количество()>0 тогда
	  	ТаблЦен2 = ЗаполнитьЦеныПоПоследнемуПоступлению(МассивНоменклатур2, Организация, ДатаСреза);
		МассивНоменклатур2.Очистить();
		
		Для Каждого СтрокаЦены из ТаблЦен2 цикл
			Если СтрокаЦены.цена = 0  ТОгда
				МассивНоменклатур2.Добавить(СтрокаЦены.Номенклатура);
			Иначе
				МассивСтрок = ТаблЦен1.НайтиСтроки(Новый Структура("Номенклатура, Цена",СтрокаЦены.Номенклатура,0));
				Для каждого СтрокаМассиваСтрок из МассивСтрок Цикл
					СтрокаМассиваСтрок.Цена = СтрокаЦены.цена;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;		
		
		Если МассивНоменклатур2.Количество()>0 Тогда
			 ТаблЦен3 = ЗаполнитьЦеныПоТипуЦен(МассивНоменклатур2, ТипЦены, ДатаСреза);
			 Для Каждого СтрокаЦены из ТаблЦен3 цикл
				 Если СтрокаЦены.цена > 0  ТОгда
					 МассивСтрок = ТаблЦен1.НайтиСтроки(Новый Структура("Номенклатура, Цена",СтрокаЦены.Номенклатура,0));
					 Для каждого СтрокаМассиваСтрок из МассивСтрок Цикл
						 СтрокаМассиваСтрок.Цена = СтрокаЦены.цена;
					 КонецЦикла;
				 КонецЕсли;
			 КонецЦикла;	
		КонецЕсли;
		
	  КонецЕсли;
	  
  Возврат ТаблЦен1;
  
КонецФункции
 
Процедура ПостроитьДеревоВыпуска(ДеревоВыпуска, пПлан) Экспорт
	
	МассивНоменклатур = Новый Массив;
	ПостроитьДеревоПлановогоВыпуска(ДеревоВыпуска, пПлан, МассивНоменклатур);	
КонецПроцедуры
 
Процедура ПостроитьДеревоПлановогоВыпуска(ДеревоВыпуска, пПлан, МассивНоменклатур) Экспорт
	
	МассивПродукция = пПлан.Товары.НайтиСтроки(Новый Структура("КодСтрокиРодитель",ПустойУникИдентификатор));
	
	Для Каждого СтрокаПродукция из МассивПродукция цикл
		пГотоваяПродукция = СтрокаПродукция.Номенклатура;
		ВсегоОпераций=0;
		ВсегоЧасовПоОперациям = 0;
		
		СтрокаДерева = ДеревоВыпуска.Строки.Добавить();
		СтрокаДерева.КодСтроки = СтрокаПродукция.КодСтроки;
		СтрокаДерева.Номенклатура = СтрокаПродукция.Номенклатура;
		СтрокаДерева.ВариантПроизводства = СтрокаПРодукция.ВариантПроизводства;
		
		СтрокаДерева.Количество = СтрокаПродукция.ВПроизводство;
		
		СуммаИтог = 0;
		ВсегоЧасов = 0;
		ЗаполнитьЗависимыеДанныеПроизводства(пПлан, СтрокаДерева, СтрокаПродукция.КодСтроки, СуммаИтог, ВсегоЧасов, МассивНоменклатур);
		
		СтрокаДерева.Сумма = СуммаИтог;
		Если СтрокаДерева.Количество > 0 Тогда
		 СтрокаДерева.Цена = СтрокаДерева.Сумма / СтрокаДерева.Количество;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры	


Процедура ЗаполнитьЗависимыеДанныеПроизводства(пПлан, СтрокаДерева, КлючСтроки, СуммаИтог, ИтогоЧасов, МассивНоменклатур)
	//Добавляем операции
	ЧасовПоВыпуску = 0;
	МассивОпераций = пПлан.ПланПоОперциям.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтроки));
	Для Каждого ЭлементОперации из МассивОпераций Цикл
		СтрокаСырье = СтрокаДерева.Строки.Добавить();
		СтрокаСырье.КодСтроки = ЭлементОперации.КодСтроки;
		СтрокаСырье.Номенклатура = ЭлементОперации.Номенклатура;
		СтрокаСырье.Количество = ЭлементОперации.Норма;
		СтрокаСырье.ЭтоРабота = Истина;
		СтрокаСырье.КлючСтроки = КлючСтроки;
		СтрокаСырье.Цена = ЭлементОперации.ПлановаяЦена;
		СтрокаСырье.Сумма = СтрокаСырье.Цена * СтрокаСырье.Количество;
		
		Если МассивНоменклатур.Найти(СтрокаСырье.Номенклатура) = Неопределено Тогда
			МассивНоменклатур.Добавить(СтрокаСырье.Номенклатура);
		КонецЕсли;
		
		СуммаИтог = СуммаИтог + СтрокаСырье.Сумма;
		
		ЧасовПоВыпуску = ЧасовПоВыпуску + ЭлементОперации.Норма;
	КонецЦикла;	
	
	ВариантПроизводстваНаКоличество = СтрокаДерева.ВариантПроизводства.Количество;
	Если ВариантПроизводстваНаКоличество=0 Тогда
		ВариантПроизводстваНаКоличество = 1;
	КонецЕсли;	
	//Нормируем часы
	ЧасовПоВыпуску = ЧасовПоВыпуску * СтрокаДерева.Количество / ВариантПроизводстваНаКоличество;
	
	
	ИтогоЧасов = ИтогоЧасов + ЧасовПоВыпуску;
	
	Если МассивОпераций.Количество()=0 Тогда
		ИтогоЧасов = ИтогоЧасов + СтрокаДерева.ВариантПроизводства.ВремяПроизводстваЧас * СтрокаДерева.Количество / ВариантПроизводстваНаКоличество; //СтрокаДерева.ВариантПроизводства.Количество;
	КонецЕсли;	
	
	//Добавляем сырье
	МассивСырье = пПлан.РеквизитТаблицаПлана.НайтиСтроки(Новый Структура("КлючСтроки",КлючСтроки));
	Для Каждого ЭлементСырье из МассивСырье Цикл
		СтрокаСырье = СтрокаДерева.Строки.Добавить();
		СтрокаСырье.КодСтроки = ЭлементСырье.КодСтроки;
		СтрокаСырье.Номенклатура = ЭлементСырье.Номенклатура;
		СтрокаСырье.Количество = ЭлементСырье.ПотребностьПоготовойПродукции;
		СтрокаСырье.КлючСтроки = КлючСтроки;
		//Пытаемся загрузить - а вдруг у него есть свой вариант производства
		МассивТовары = пПлан.Товары.НайтиСтроки(Новый Структура("Номенклатура, КодСтрокиРодитель",Элементсырье.Номенклатура, КлючСтроки));
		Если МассивТовары.Количество() > 0 Тогда //Значит это полуфабрикат
			СтрокаСырье.ВариантПроизводства = МассивТовары[0].ВариантПроизводства;
			СтрокаСырье.Цена = МассивТовары[0].ПлановаяЦена;
			
			СуммаПродукции = 0;
			ЗаполнитьЗависимыеДанныеПроизводства(пПлан, СтрокаСырье, МассивТовары[0].КодСтроки, СуммаПродукции, ИтогоЧасов, МассивНоменклатур);
			СтрокаСырье.Сумма = СуммаПродукции;
			
			Если СтрокаСырье.Количество > 0 И СтрокаСырье.Цена=0 Тогда
				СтрокаСырье.Цена = СтрокаСырье.Сумма / СтрокаСырье.Количество;
			КонецЕсли;

		Иначе
			СтрокаСырье.ЭтоСырье = Истина;
			СтрокаСырье.Цена = ЭлементСырье.ПлановаяЦена;
			СтрокаСырье.Сумма = СтрокаСырье.Цена * СтрокаСырье.Количество;
			
			Если МассивНоменклатур.Найти(СтрокаСырье.Номенклатура) = Неопределено Тогда
				МассивНоменклатур.Добавить(СтрокаСырье.Номенклатура);
			КонецЕсли;
		КонецЕсли;	
		
		СуммаИтог = СуммаИтог + СтрокаСырье.Сумма;

	КонецЦикла;
	
КонецПроцедуры	

Процедура УдалениеПланаПроизводстваПродукции(ИнфоСтруктура, ОбъектДокумент) Экспорт
	
	МассивСтрок = ОбъектДокумент.РеквизитТаблицаПлана.НайтиСтроки(Новый Структура("ГотоваяПродукция, КлючСтроки",ИнфоСтруктура.Номенклатура,ИнфоСтруктура.КодСтроки));
	Для Каждого СтрокаУдаления из МассивСтрок Цикл
		
		
		//Смотрим если этот пункт еще был и полуфабрикатом
		ОтборПоиска = Новый Структура("КодСтроки, Номенклатура, КодСтрокиРодитель",СтрокаУдаления.КодСтроки, СтрокаУдаления.Номенклатура, ИнфоСтруктура.КодСтроки);
		МассивПродукция = ОбъектДокумент.Товары.НайтиСтроки(ОтборПоиска);
		Для Каждого СтрокаПродукция из МассивПродукция цикл
			пГотоваяПродукция = СтрокаПродукция.Номенклатура;
			ДанныеСтроки = Новый Структура("Номенклатура, КодСтроки",пГотоваяПродукция, СтрокаПродукция.КодСтроки);
			УдалениеПланаПроизводстваПродукции(ДанныеСтроки, ОбъектДокумент);
			ОбъектДокумент.Товары.Удалить(СтрокаПродукция);
		КонецЦикла;
		
		ОбъектДокумент.РеквизитТаблицаПлана.Удалить(СтрокаУдаления);
		
	КонецЦикла;	
	
	//Удаляем операции
	МассивСтрок = ОбъектДокумент.ПланПоОперциям.НайтиСтроки(Новый Структура("ГотоваяПродукция, КлючСтроки",ИнфоСтруктура.Номенклатура,ИнфоСтруктура.КодСтроки));
	Для Каждого СтрокаУдаления из МассивСтрок Цикл
		ОбъектДокумент.ПланПоОперциям.Удалить(СтрокаУдаления);
	КонецЦикла;	
	
	
			
КонецПроцедуры	

ПустойУникИдентификатор = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
